Repository: muhammadmudassar12/.Net7-BoilerPlate
Catalog: src/Core/Application/Resources/langResApplication.*.resx
Languages: ar_sa

# AccountApprovedMessage
source: Your account has been approved
ar_sa: تمت الموافقة على حسابك

# AccountApprovedTitle
source: Account Approved
ar_sa: تمت الموافقة على الحساب

# AccountBlocked
source: Your account is blocked
ar_sa: تم حظر حسابك

# AccountDeleted
source: Kindly register first to login
ar_sa: يرجى التسجيل أولا لتسجيل الدخول

# AccountNotCreatedPleaseCheckDetails
source: Account Not Created Please Check The Details and Resubmit
ar_sa: لم يتم إنشاء الحساب ، يرجى التحقق من التفاصيل وإعادة التقديم

# AccountRejected
source: Your account is rejected
ar_sa: تم رفض حسابك

# AlreadyExists
source: Entity '{0}' already exists
ar_sa: الهيئة "{0}" موجودة بالفعل

# AppointmentAlreadyExists
source: Your appointment already exists on the same date and time
ar_sa: موعدك موجود بالفعل في نفس التاريخ والوقت

# AppointmentAssignedToLawyer
source: New appointment with reference number {1} has been assigned to you. Appointment is on {0}
ar_sa: تم تعيين موعد جديد بالمرجع رقم {1} لك. الموعد هو في {0}.

# AppointmentAssignedToLawyerAdmin
source: Appointment with reference number {1} has been assigned to lawyer '{0}'
ar_sa: تم تعيين موعد بالمرجع رقم {1} مع المحامي '{0}'.

source: Appointment Booked
ar_sa: تم حجز الموعد

source: Appointment Chat
ar_sa: دردشة الموعد

# AppointmentChatMsgToUser
source: You have a New Appointment Chat
ar_sa: لديك دردشة موعد جديد

# AppointmentCancelled
source: Appointment has been cancelled successfully
ar_sa: تم إلغاء الموعد بنجاح

# AppointmentCancelledTitle
source: Appointment Cancelled
ar_sa: تم إلغاء الموعد

# AppointmentCancelMsgToCustomer
source: Your appointment with reference number {0} has been successfully cancelled, the amount will be refunded to your bank account
ar_sa: تم إلغاء موعدك بالمرجع رقم{0} بنجاح، سيتم استرداد المبلغ إلى حسابك البنكي.

# AppointmentCancelMsgToLawyer
source: Your appointment with reference number {0} has been canceled by the client, please see the details through the application
ar_sa: تم إلغاء موعدك بالمرجع رقم {0} من قبل العميل، يرجى الاطلاع على التفاصيل من خلال التطبيق.

# AppointmentDateReserved
source: It seems that this appointment date is reserved 'busy'
ar_sa: موعد هذا التاريخ محجوز بالفعل

# AppointmentInPreviousDate
source: You can not book the appointment in the previous date and time
ar_sa: لا يمكن حجز موعد في التاريخ والوقت السابقين

# AppointmentIsCreated
source: Appointment created successfully. Thank you
ar_sa: تم حجز الموعد بنجاح، شكراً لك

source: Appointment Not Exists
ar_sa: الموعد غير موجود

source: Appointment Reassigned
ar_sa: تمت إعادة تعيين الموعد

# AppointmentNotUpdated
source: The Appointment has not been Updated
ar_sa: لم يتم تحديث الموعد

# AppointmentUpdated
source: The Appointment has been Updated Successfully
ar_sa: تم تحديث الموعد بنجاح

# AppointOrMasterReqIdRequired
source: Appointment/Master request/Lawyer Extra Service Offer Id is required
ar_sa: يجب إدخال رقم العرض الخاص بالحجز أو الطلبات أو الخدمات الإضافية

source: Approved
ar_sa: مقبول

source: Bid Approved
ar_sa: تم قبول العرض

# BidApprovedToAdmin
source: Customer approved a bid
ar_sa: وافق العميل على العرض

source: Bidding Time Expired
ar_sa: انتهى وقت العرض

source: Blocked
ar_sa: ممنوع

source: Booked
ar_sa: محجوز

source: Both
ar_sa: كلاهما

source: Call Initialized
ar_sa: تم اجراء المكالمة

# CallsAreDisabled
source: Calls are disabled from default configuration
ar_sa: تم تعطيل المكالمات

source: Cancelled
ar_sa: تم الإلغاء

# ClickResetPasswordLink
source: To retrieve the Shura password, please click on the following link. {0}
ar_sa: {0} لاسترجاع كلمة المرور الخاصة بتطبيق شورى، اضغط على الرابط التالي

source: Closed
ar_sa: مغلق

source: Completed
ar_sa: مكتمل

source: Customer Phone Number Not Exists
ar_sa: رقم هاتف العميل غير موجود

source: Deleted
ar_sa: محذوف

source: Deleted Already
ar_sa: تم حذفه بالفعل

source: Delete Successfully
ar_sa: تم الحذف بنجاح

# DiscountNote
source: {0}% Discount (Max SR{1})
ar_sa: خصم {0}% (الحد الأقصى {1} ريال سعودي)

# EmailSendSuccesfully
source: Email sent successfully
ar_sa: تم إرسال البريد الإلكتروني بنجاح

source: Employee Not Found
ar_sa: لم يتم العثور على الموظف

# EmployeePermissionUpdatedSuccessfully
source: Employee Permission has been updated Successfully.
ar_sa: تم تحديث إذن الموظف بنجاح.

# ErrorFileDelete
source: There is an error while deleting {0} file.
ar_sa: حدث خطأ أثناء حذف {0} ملف

# ErrorOnAddingPass
source: An error occurred while adding the new password
ar_sa: حدث خطأ أثناء إضافة كلمة مرور جديدة

# ErrorOnChangingPass
source: An error occurred while changing the old password
ar_sa: حدث خطأ أثناء تغيير كلمة المرور القديمة

# ErrorSendingOTP
source: Error while sending otp
ar_sa: خطأ أثناء إرسال رمز التحقق

# ErrorWhileLoginByNumber
source: Error while logging in with {0} {1}
ar_sa: خطأ أثناء تسجيل الدخول باستخدام {0} {1}

# ErrorWhileMobileRequest
source: an error while trying to complete the mobile request details.
ar_sa: حدث خطأ أثناء استكمال تفاصيل طلب الهاتف المحمول

# ErrorWhileUpdatingLawyerAvailability
source: There is an error while creating lawyer availability
ar_sa: حدث خطأ أثناء إنشاء فترات توافر المحامي

# ErrorWhileUpdatingUserInfo
source: There was an error while updating User info
ar_sa: حدث خطأ أثناء تحديث معلومات المستخدم

# ErrorWhileUpdatingPermissionInfo
source: There was an error while updating Permission info
ar_sa: حدث خطأ أثناء تحديث معلومات الإذن

# ErrorWhileUpdatingEmployeePermissionInfo
source: There was an error while updating Employee Permission info
ar_sa: حدث خطأ أثناء تحديث معلومات إذن الموظف

source: Expired
ar_sa: انتهى

source: Failed
ar_sa: فشل

# FileNameCantBeNullOrEmpty
source: File name can not be null or empty
ar_sa: لا يمكن أن يكون اسم الملف فارغاً

source: File Not Found
ar_sa: لم يتم العثور على الملف

# GPTStatus
source: Request status
ar_sa: حالة طلبك

# GPTStatusIsApproved
source: Request status is approved
ar_sa: تم الموافقة على طلبك لتجربة مشير

# InvalidCredentials
source: The credential '{0}' is invalid.
ar_sa: بيانات التسجيل "{0} غير صالحة"

# InvalidCredentialsForEmail
source: The credential '{0} is invalid'.
ar_sa: بيانات التسجيل "{0} غير صالحة"

# InvalidPromotionCode
source: No promotion found or promotion code is invalid
ar_sa: لم يتم العثور على عروض أو أن الرمز الترويجي غير صالح

source: invalid refresh token
ar_sa: رمز تحديث غير صالح

source: Invalid Token
ar_sa: رمز غير صالح

# IsPromoCodeApplicableForMobileCat
source: The discount code does not apply to the chosen specialization
ar_sa: كود الخصم لا ينطبق على التخصص المختار

# IsPromoCodeApplicableForPackage
source: The discount code does not apply to this package
ar_sa: كود الخصم لا ينطبق على هذه الباقه

# LawyerAssigned
source: Lawyer is assigned to appointment successfully
ar_sa: تم تعيين المحامي للموعد بنجاح

# LawyerCanNotBeDeleteBlockRej
source: This Lawyer can not be marked as Block/Reject or Delete because the lawyer has future appointment(s) pending.
ar_sa: لا يمكن حظر أو رفض هذا المحامي لوجود مواعيد مستقبلية معلقة

# LawyerCertificateNameExists
source: Educational Certificate name already exists please change
ar_sa: اسم الشهادة التعليمية موجود بالفعل يرجى تغييره

# LawyerExtraServiceOfferCreate
source: Your Request is received and under process. We will respond you with best solution in {0}.
ar_sa: تم استقبال طلبك وجاري معالجته، سنتواصل معك في خلال {0}

# LawyerIsBusy
source: Lawyer seems busy in this schedule, try another lawyer
ar_sa: المحامي مشغول في هذا الموعد، ابحث عن محامٍ آخر

# LawyerNotCreated
source: Lawyer Not Created Successfully
ar_sa: فشل في إنشاء صفحة المحامي

source: Lawyer Not Found
ar_sa: لم يتم العثور على محامي

source: Lawyer Phone Number not exists
ar_sa: رقم هاتف المحامي غير موجود

# MasterRequestCreate
source: Your Request is received and under process. We will respond you with best solution in {0}.
ar_sa: تم استقبال طلبك وجاري معالجته، سنتواصل معك في خلال {0}

source: Master Request Not Exists
ar_sa: الطلب غير موجود

# MissedAppointmentLawyer
source: You have missed an appointment with reference number {1} at {0}.
ar_sa: لقد فاتك الموعد بالمرجع رقم {1} في {0}

source: Mobile
ar_sa: الهاتف المحمول

source: Mobile user created successfully
ar_sa: تم إنشاء حساب مستخدم الهاتف المحمول بنجاح

# MRCanNotBeCancelBCUndrProc
source: Master request can not be cancel because its under processing
ar_sa: لا يمكن إلغاء الطلب لأنه تحت التنفيذ

# MSCanBeMarkAsCancelBCAprovBidFound
source: Master request can not be mark as canceled because an approve bid is found on it.
ar_sa: لا يمكن إلغاء الطلب بسبب قبول عرض

source: New Appointment Assigned
ar_sa: تم تعيين موعد جديد

source: New Bid
ar_sa: عرض جديد

# NewBidCreate
source: A new bid has been created
ar_sa: تم إنشاء عرض جديد

# NewBidCreateToAdmin
source: A new bid has been added by the lawyer
ar_sa: تم إضافة عرض جديد من قبل المحامي

source: New Message
ar_sa: رسالة جديدة

# NewRequestMessage
source: You have got a new request with reference number
ar_sa: لقد تلقيت طلبًا جديدًا بالمرجع رقم

# NewRequestMessageToAdmin
source: New request with reference number {0} , is added by customer
ar_sa: تمت إضافة طلب جديد بالمرجع رقم {0} من قبل العميل.

# NewRequestTitle
source: New Request
ar_sa: طلب جديد

# NoAccessToCreateAvailability
source: Your lawyer account status is {0}. Please contact admin to create availability slots
ar_sa: حالة حساب المحامي هي {0}. برجاء التواصل مع المسؤول لإنشاء خانات متاحة جديدة

# NoAppointmentAvailable
source: There is no appointment available on ID {0}
ar_sa: لا توجد مواعد متاحة للحساب {0}

# NoApprovedBidFound
source: No approved bid found on the Master Request({0})
ar_sa: لم يتم العثور على عروض مقبولة لطلبك ({0})

# NoAvailableSchedule
source: There is no available schedules
ar_sa: لا توجد مواعيد متوفرة

# NoAvailableSlot
source: There is no available slot for the lawyer
ar_sa: لا يوجد مكان متاح للمحامي

# NoLawyerOnUserAccount
source: There is no active lawyer related to your account. Please contact administrator
ar_sa: لا يوجد محامي متاح لحسابك، برجاء التواصل مع مسؤول

# NoPaymentExists
source: There is no payment available. Please check the payment id
ar_sa: لا توجد دفعة متاحة، برجاء التأكد من وسيلة الدفع

source: No Record Found
ar_sa: لم يتم العثور على سجلات

source: No response from Payment server
ar_sa: لم يتم استقبال رد من خادم الدفع

# NotAuthorized
source: You are not authorized to login. Please Contact Admin.
ar_sa: لا يسمح لك بتسجيل الدخول، برجاء التواصل مع مسؤول

# NotifyAdminMissAppointmentMessage
source: Lawyer:{0} Phone:{1} Appointment Time:{2}
ar_sa: الموعد الفائت للمحامي : {0} الهاتف : {1} وقت الموعد : {2}

# NotifyAdminMissAppointmentTitle
source: Missed Appointment
ar_sa: موعد فائت

# NotifyAdminNewAppointmentMessage
source: Referance Number: {3} Lawyer:{0} Client:{1} Appointment Time:{2}
ar_sa: المرجع رقم: {3} الموعد القادم للمحامي : {0} العميل : {1} موعد التاريخ والوقت : {2}

# NotifyAdminNewAppointmentTitle
source: New Appointment Booked
ar_sa: تم حجز موعد جديد

# NotifyAdminUpcomingAppointmentMessage
source: Referance Number: {3} Lawyer:{0} Client:{1} Appointment Time:{2}
ar_sa: المرجع رقم: {3} المحامي: {0} الهاتف: {1} وقت الموعد: {2}

# NotifyAdminUpcomingAppointmentTitle
source: Client Upcoming Appointment
ar_sa: الموعد القادم للعميل

# OTPCreated
source: otp just created less than 1 minute ago, please try again later.
ar_sa: تم إنشاء رمز التحقق قبل أقل من دقيقة، برجاء المحاولة مجدداً

# OTPSendSuccessfully
source: otp sent successfully
ar_sa: تم إرسال رمز التحقق بنجاح

source: Parent Appointment Id Is Not Valid Or Record Not Found
ar_sa: رقم الموعد غير صحيح أو غير موجود

# PasswordChangeSuccessfully
source: Password changed successfully
ar_sa: تم تغيير الرقم السري بنجاح

source: PaymentPending
ar_sa: بانتظار الدفع

source: Pending
ar_sa: قيد الانتظار

# PermissionNotAdded
source: Permission could not be created.
ar_sa: لا يمكن إنشاء الإذن

source: Permission updated successfully.
ar_sa: تم تحديث الإذن بنجاح.

source: Permission status updated successfully.
ar_sa: تم تحديث حالة الإذن بنجاح.

# PhoneNoAlreadyExists
source: Mobile phone number {0} already exists.
ar_sa: رقم الهاتف المحمول {0} موجود بالفعل.

# PleaseDefineCategory
source: Please define at least one Category
ar_sa: برجاء تحديد فئة واحدة على الأقل

# PleaseDefineMasterCategory
source: Please define at least one Master Category
ar_sa: برجاء تحديد فئة رئيسية واحدة على الأقل

source: Priority Is Not Defined
ar_sa: لم يتم تحديد الأولوية

source: Profile Delete Successfully
ar_sa: تم حذف الملف الشخصي بنجاح

source: Profile updated successfully
ar_sa: تم تحديث الملف الشخصي بنجاح

# ProvideMasterRequestOrAppointmentId
source: Please Provide Master Request id Or Appointment Id
ar_sa: برجاء إدخال رقم الطلب أو الموعد

source: Record Is Already Updated
ar_sa: تم تحديث السجل بالفعل

source: Record Not Found
ar_sa: لم يتم العثور على أي سجل

source: Record Updated
ar_sa: تم تحديث السجل

# RegisterAsMobileUser
source: You are not registered as mobile user. Please register yourself before login. Thank you
ar_sa: لست مسجل كمستخدم هاتف محمول، برجاء التسجيل قبل تسجيل الدخول، شكراً لك

# RegisterWithTamara
source: Sorry for inconvenience. Please register yourself with Tamara.co before checkout
ar_sa: عذراً على الإزعاج، برجاء التسجيل عبر Tamara.co قبل إتمام الطلب

source: Rejected
ar_sa: مرفوض

# RequestOrNameAlreadyExists
source: Request standard id or name already exist in the database
ar_sa: رقم الطلب أو الاسم موجود بالفعل في قاعدة البيانات

# RequestTypeIdOrNameAlreadyExists
source: Request type id or name already exist in the database
ar_sa: رقم نوع الطلب أو الاسم موجود بالفعل في قاعدة البيانات

# RequiredPaymentService
source: The payment service field is not updated. Please update it with proper name Tamara/Oppwa
ar_sa: لم يتم تحديث خانة خدمة الدفع، برجاء تحديثها بالبيانات الصحيحة

source: Reserved
ar_sa: محجوز

source: Save Successfully
ar_sa: تم الحفظ بنجاح

# ScheduleIdNotExist
source: This Schedule Id doesn't exist
ar_sa: رقم الموعد غير موجود

# SelectPaymentService
source: Please select the payment service(OPPWA/TAMARA) before checkout
ar_sa: برجاء اختيار خدمة الدفع (OPPWA/TAMARA) قبل إتمام الطلب

source: Sent successfully
ar_sa: تم الإرسال بنجاح

source: Shwra Appointment
ar_sa: موعد شورى

# SmsAppointmentBookedClient
source: Your counseling appointment with reference number {2} with Lawyer has been booked on {0} at {1}
ar_sa: تم حجز موعد الاستشارة الخاص بك مع المحامي بالمرجع رقم {2} في {0} الساعة {1}.

# SmsAppointmentBookedLawyer
source: You have been booked for a consultation with a client on {0} {1} Referance Number: {3}
ar_sa: لقد تم حجز إستشارة لديك مع أحد العملاء في يوم {0} الساعة : {1} بالمرجع رقم {2}

source: SubTypeId not found
ar_sa: لم يتم العثور على رقم SubType

# ThirdPartyCallerAPIIssue
source: There was an issue sending request to Third Party Caller API
ar_sa: حدثت مشكلة أثناء إرسال طلب إلى مشغل الخدمة

# UnknownIssue
source: An unknown issue occurred
ar_sa: نواجه مشكلة غير معروفة

# UnSuccessfulUpdate
source: The update did not complete successfully.
ar_sa: لم يكتمل التحديث بنجاح

# UpcomingAppointment
source: You have upcoming appointment at {0}
ar_sa: لديك موعد قادم في {0}

# UserAccountStatusMessage
source: You can not login because your account status is {0}
ar_sa: لا يمكنك تسجيل الدخول لأن حالة حسابك هي {0}

source: User Already Exists
ar_sa: المستخدم موجود اصلا

# UserCanNotTakeAppointmentTimeIsPassed
source: You can not request for an appointment because the selected time has passed. Please retry to select different time and try to fill out application before the selected time
ar_sa: لا يمكنك طلب موعد لأن الوقت المحدد قد مضى. يرجى إعادة المحاولة لتحديد وقت مختلف ومحاولة ملء الطلب قبل الوقت المحدد

# UserLoggedInSuccessfully
source: The user is logged in successfully
ar_sa: تم تسجيل دخول المستخدم بنجاح

# UserNameExists
source: Username {0} already exists.
ar_sa: اسم المستخدم {0} موجود بالفعل

# UserNotExistsWithPhone
source: User with phone number {0} does not exist.
ar_sa: لا يوجد مستخدم مسجل برقم هاتف {0}

source: User not found
ar_sa: لم يتم العثور على المستخدم

# UserWithEmailNotExists
source: User with {0} does not exist.
ar_sa: المستخدم {0} غير موجود

# UserWithPhoneNoNotFound
source: User with phone number {0} {1} not found.
ar_sa: لا يوجد مستخدم مسجل برقم هاتف {0} {1}

# ValidDateRange
source: Please provide valid date range
ar_sa: برجاء إدخال نطاق زمني صحيح

source: Web
ar_sa: الويب

source: Wrong email
ar_sa: بريد إلكتروني خاطئ

# YouCanNotDeleteBecauseApproved
source: You can not delete the bid now because the bid is approved by customer
ar_sa: لا يمكنك حذف العرض الآن بعد قبوله من العميل

source: You Have Already Place Your Bid
ar_sa: قمت بالفعل بتقديم عرض

# YouHaveMarkedCompleted
source: You have marked completed. You can not send further messages.
ar_sa: تم إنهاء العمل، لا يمكنك إرسال المزيد من الرسائل

# YourAccountIsApporvedAlready
source: Your Account Is Approved Already
ar_sa: تمت الموافقة على حسابك بالفعل

source: Your Account Is Not Active
ar_sa: حسابك معلق

# YourBidIsApproved
source: Your Bid has been Approved
ar_sa: تم قبول عرضك

source: Your request has been submitted
ar_sa: تم تقديم طلبك

# NotifyAppointmentTimeChangedTitle
source: Appointment Time Is Changed
ar_sa: تم تغيير وقت الموعد

# NotifyAppointmentTimeUpdateMsg
source: Your appointment with reference no {0} time is changed to {1}
ar_sa: تم تغيير موعدك ذو المرجع رقم {0} إلى {1}

# DiscountAmountLimit
source: Discount Amount Limit can not be greater than 1000
ar_sa: ڈسکاؤنٹ کی رقم کی حد 1000 سے زیادہ نہیں ہو سکتی

# DiscountLimit
source: Discount Limit can not be greater than 100
ar_sa: ڈسکاؤنٹ کی حد 100 سے زیادہ نہیں ہو سکتی

# LawyerCanNotBeDeleted
source: Lawyer cannot be deleted because of upcoming booked appointment(s)
ar_sa: لا يمكن حذف حسابك حاليا بسبب وجود موعد قادم

# AppointmentPaymentPendingClient
source: Your counseling appointment with reference number {0} has been created on {1} at {2}. Please login on SHWRA app to proceed for payment.
ar_sa: تم تحديد موعد الاستشارة الخاص بك بالرقم المرجعي {0} في {1} في {2}. يرجى تسجيل الدخول على تطبيق شورى لمتابعة عملية الدفع.
